app/views/videos/show.html.erb

SELECT `actors`.`id` FROM `actors` INNER JOIN `actors_videos` ON `actors`.`id` = `actors_videos`.`actor_id` WHERE `actors_videos`.`video_id` = 37
---
  <!-- <%=link_to 'Actors', actors_path %> -->
 <%= @video.actors.each do |a| %>