app/controllers/actors_controller.rb

SELECT `actors`.* FROM `actors`
---
  def index
    @actors = Actor.all

SELECT  `actors`.* FROM `actors` WHERE `actors`.`id` = 0 LIMIT 1
---
  def show
    @actor = Actor.where(id: params[:id]).first

INSERT INTO `actors` (`name`, `age`, `rating`) VALUES ('ayush', 20, 5)
---
  def create
    @actor = Actor.new(actor_params)

    respond_to do |format|
      if @actor.save

UPDATE `actors` SET `name` = 'asdasd' WHERE `actors`.`id` = 5
---
  def update
    respond_to do |format|
      if @actor.update(actor_params)

DELETE FROM `actors` WHERE `actors`.`id` = 1
---
  def destroy
    @actor.destroy

SELECT  `actors`.* FROM `actors` WHERE `actors`.`id` = 1 LIMIT 1
---
    def set_actor
      @actor = Actor.find(params[:id])