app/controllers/videos_controller.rb

SELECT  `videos`.* FROM `videos` WHERE `videos`.`type` IN ('Video::Movie') ORDER BY `videos`.`id` DESC LIMIT 1
---
  def index
   if params[:id].nil?
      @video = Video.all

INSERT INTO `videos` (`title`, `language`, `genre`, `year_release`, `type`) VALUES ('lslsl', 'Hindi', 'Animation', 1949, 'Video::TvShow')
---
  def create
    @video = Video.new(video_params)

     respond_to do |format|
      if @video.save

DELETE FROM `videos` WHERE `videos`.`type` IN ('Video::Movie') AND `videos`.`id` = 1
---
  def destroy
    @video.destroy

SELECT  `videos`.* FROM `videos` WHERE `videos`.`type` IN ('Video::Movie') ORDER BY `videos`.`id` DESC LIMIT 1
---
    def set_video
      @video = Video.find(params[:id])