app/controllers/welcome_controller.rb

SELECT `videos`.* FROM `videos` WHERE `videos`.`type` IN ('Video::Movie')
---
	def movie_index
		@movies=Video::Movie.all

SELECT `videos`.* FROM `videos` WHERE `videos`.`type` IN ('Video::TvShow')
---
	def tvshow_index
	  @tvshows=Video::TvShow.all

SELECT  `videos`.* FROM `videos` WHERE `videos`.`type` IN ('Video::TvShow') ORDER BY `videos`.`id` ASC LIMIT 1
---
	def set_cast
      @video = Video.find(params[:id])